using MyDemo.UI.Models;
using Newtonsoft.Json;

namespace MyDemo.UI.Data
{
    public class RecipeData
    {
        public List<Recipe> Recipes { get; set; }

        public RecipeData()
        {
            string jsondata = @"[
                    {
                        ""Title"": ""ပုစွန်ထုပ်ကြော်"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""အလတ်စားပုစွန်ထုပ်"",
                                ""Amount"": ""၂၅ ကျပ်သား""
                            },
                            {
                                ""Name"": ""တရုတ်လိမ္မော်ရည် (သို့) လိမ္မော်ရည်"",
                                ""Amount"": ""၁ ခွက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            },
                            {
                                ""Name"": ""ဂျုံမှုန့်"",
                                ""Amount"": ""၁ ဇွန်း (စားပွဲတင်ဇွန်း)""
                            },
                            {
                                ""Name"": ""သကြား"",
                                ""Amount"": ""တစ်ဝက် (လက်ဖက်ရည်ပန်းကန်လုံး)""
                            },
                            {
                                ""Name"": ""ဆား"",
                                ""Amount"": ""တစ်ဝက် (လက်ဖက်ရည်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ဟင်းချက်ဆီ"",
                                ""Amount"": ""၁ ခွက် (လက်ဖက်ရည်ပန်းကန်လုံး)""
                            }
                        ],
                        ""Method"": [
                            ""ပုစွန်တုပ်များကို ရေစင်စင်ဆေးပြီး ကိုင်ထားပါ။"",
                            ""ဆီကိုဒယ်အိုးထဲထည့်၍ မီးအနေတော်ဖြင့်အပူပေးပါ။ ဆီကျက်လျှင် ပုစွန်တုပ်များထည့်၍ကြော်ပါ။ ကျက်ပြီဆိုလျှင် ဆယ်၍ ပန်းကန်ပြားတစ်ချပ်အတွင်း ပြင်ဆင်ထည့်ထားပါ။"",
                            ""ဆော့စ်ကြိုသည့် ဒယ်အိုးပြားတွင် လိမ္မော်ရည်၊ သကြားနှင့် ဆားထည့်၍ မီးအပူပေးပါ။ ထို့နောက်ဂျံုမှုန့်ကို ရေအနည်းငယ်နှင့် ဖျော်ပြီးထည့်ပါ။ ဆက်မွှေပေးရင်းမှ လိမ္မော်ဆော့စ် စေးပျစ်လာပြီဆိုလျှင် အသင့်ပြင်ထားသော ပုစွန်တုပ်ကြော်ပေါ်သို့ လောင်းထည့်လိုက်ပါ။""                            
                        ],
                        ""ImageURL"": ""/img/5.jpg""
                    },
                    {
                        ""Title"": ""နံရိုးကင်"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""အဆီနည်းသောနံရိုးနု"",
                                ""Amount"": ""ငါးဆယ်ကျပ်သား""
                            },
                            {
                                ""Name"": ""နုပ်နုပ်စဉ်းထားသောစပါးလင်"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၃ ဇွန်း""
                            },
                            {
                                ""Name"": ""နုပ်နုပ်စဉ်းထားသော သံပရိုရွက်"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၁ ဇွန်း""
                            },
                            {
                                ""Name"": ""ပါးပါးလှီးထားသော ကြက်သွန်နီဥသေး"",
                                ""Amount"": ""၅ လုံး""
                            },
                            {
                                ""Name"": ""နံနံစေ့အမှုန့်"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၁ ဇွန်း""
                            },
                            {
                                ""Name"": ""စေးပျစ်အောင်ကျိုထားသောအုန်းနို့ဦးရည်နှစ်"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံးတစ်ဝက်""
                            },
                            {
                                ""Name"": ""မဆလာမှုန့်"",
                                ""Amount"": ""လက်ဖက်ရည်ဇွန်း ၂ ဇွန်း""
                            },
                            {
                                ""Name"": ""ဆား"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၁ ဇွန်း""
                            },
                            {
                                ""Name"": ""နာနတ်ရည်"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး ၁ လုံး""
                            }
                        ],
                        ""Method"": [
                            ""နံရိုးနုများကို ရေစင်စင်ဆေးပြီး အနေတော်အရွယ်ဖြတ်ပါ။ နံရိုးရှိအရွက်နှင့် ကြွက်သားကြောအမျှင်များကို ဓားဖြင့်ခြစ်ထုတ်၊ ထွင်းထုတ်ပစ်ပါ။ ထို့နောက်နာနတ်ရည်ထဲတွင် ၁၀ မိနစ်ခန့်နှပ်ထားပါ။"",
                            ""စပါးလင်၊ သံပရိုရွက်၊ ကြက်သွန်နီ၊ နံနံစေ့နှင့် ဆားတို့ကိုရောပြီး မှုန့်ညက်အောင်ထောင်းပါ။"",
                            ""နံရိုးများကို နာနတ်ရည်ထဲမှထုတ်ပြီး အဆင့်၂ မှ ရောနှော၊ မဆလာမှုန့်၊ အုန်းနို့ဦးရည်နှစ်များနှင့် ရောနယ်ပါ၊ အရသာပိုရှိလာစေရန် မိနစ် ၃၀ ခန့် နှပ်ထားလိုက်ပါ။"",
                            ""ကင်စက်တွင်နံရိုးများကို 400 ံF ဖြင့် မိနစ် ၂၀ မှ ၃၀ အထိ ကင်ပါ။"",
                            ""ခရမ်းချဉ်သီးဆော့စ်၊ လတ်ဆတ်သော ဟင်းသီးဟင်းရွက်များဖြင့် ခပ်ပူပူလေး တည်ခင်းပေးပါ။""
                        ],
                        ""ImageURL"": ""/img/4.jpg""
                    },
                    {
                        ""Title"": ""ကကတစ်ကြော်"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""ပင်လယ်ကကတစ်အသား (၁ လက်မခွဲခန့်စီထူထူတုံးထားသော)"",
                                ""Amount"": ""၂၅ ကျပ်သား""
                            },
                            {
                                ""Name"": ""မုန်လာဥနီ(ပြုတ်ပြီးလှီးထားသော)"",
                                ""Amount"": ""၁ ခွက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            },
                            {
                                ""Name"": ""ဆား"",
                                ""Amount"": ""၁ ဇွန်း(လက်ဖက်ရည်ဇွန်း)""
                            },
                            {
                                ""Name"": ""သံပရာရည်"",
                                ""Amount"": ""၁ ဇွန်း(စားပွဲတင်ဇွန်း)""
                            },
                            {
                                ""Name"": ""မာဂျရင်း(ထောပတ်ခဲ)"",
                                ""Amount"": ""၂ ဇွန်း(လက်ဖက်ရည်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ဟင်းချက်ဆီ"",
                                ""Amount"": ""တစ်ဝက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            }
                        ],
                        ""Method"": [
                            ""ရေစစ်ပြီး ခြောက်နေသော ငါးအတုံးလေးများကို ဆား၊ သံပရာရည်တို့နှင့် နယ်ပြီး ဆယ်မိနစ်ခန့် နှပ်ထားပါ။"",
                            ""ဒယ်အိုးအတွင်းဆီထည့်ပြီး မီးအနေတော်ဖြင့် ငါးအတုံးများကို ကြော်ပါ။ နူးညံ့ပျော့ပျောင်းနေစေရန် တစ်ဖက်ပြီး တစ်ဖက် လှန်လှန်ပေးပါ။"",
                            ""အသားကျက်လျှင်ဆယ်ပြီး ဆီစစ်ပါ။ အသားတုံးများပူနေစဉ် မာဂျရင်းနှင့် သုတ်လိမ်းပေးပါ။ ပြုတ်ထားသော မုန်လာဥနီနှင့် တွဲဖက်တည်ခင်းပါ။""
                        ],
                        ""ImageURL"": ""/img/3.jpg""
                    },
                    {
                        ""Title"": ""မုန့်ညက်မှိုကြော်"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""မှို"",
                                ""Amount"": ""၁၀ပွင့်""
                            },
                            {
                                ""Name"": ""ကော်မှုန်"",
                                ""Amount"": ""၁ ခွက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            },
                            {
                                ""Name"": ""ရေ"",
                                ""Amount"": ""၁ ခွက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            },
                            {
                                ""Name"": ""ဟင်းချက်ဆီ"",
                                ""Amount"": ""၂ ခွက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            }
                        ],
                        ""Method"": [
                            ""မှိုများကို ရေဆေးပြီး ဘေးတွင်ရေစစ်ထားပါ။"",
                            ""ကော်မှုန့်နှင့်ရေကို ရောစပ်ပါ။"",
                            ""ဒယ်အိုးထဲတွင် ဆီထည့်၍ မီးအပူပေးပါ။ မှိုများကို မုန့်ညက်ရည်တွင်နှစ်ပြီး ဆီထဲတွင် ရွှေညိုရောင် သမ်းလာသည်အထိကြော်ပါ။ ဆယ်ပြီး ဆီစုပ်စက္ကူဖြင့် ဆီများကို စစ်ထုတ်ပစ်ပါ။ ငရုတ်ဆော့စ်နှင့်တည်ခင်းပါ။""
                        ],
                        ""ImageURL"": ""/img/2.jpg""
                    },
                    {
                        ""Title"": ""ဝက်ရိုးစွပ်ပြုတ်"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""တရုတ်ကြက်ဟင်းခါးသီး"",
                                ""Amount"": ""၁ လုံး""
                            },
                            {
                                ""Name"": ""အသားများသောဝက်ရိုး"",
                                ""Amount"": ""၁၀ ကျပ်သား""
                            },
                            {
                                ""Name"": ""စဉ်းထားသောနံနံရွက်"",
                                ""Amount"": ""၁ ဇွန်း(လက်ဖက်ရည်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ငါးငံပြာရည်"",
                                ""Amount"": ""၂ ဇွန်း(စားပွဲတင်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ရေ"",
                                ""Amount"": ""၂ ခွက်(လက်ဖက်ရည်ပန်းကန်လုံး)""
                            }
                        ],
                        ""Method"": [
                            ""ကြက်ဟင်းခါးသီးကို ရေဆေးပြီးထက်ခြမ်းခွဲပါ။ အတွင်းမှ မလိုအပ်သည်များကို ဖယ်ရှားပစ်ပါ။ အသားကို တစ်လက်မ နှစ်လက်မ အရွယ်များတုံးပါ။"",
                            ""အိုးထဲသို့ ရေထည့်ပြီး အရိုးများကို ပြုတ်ပါ။ ဆူပွက်နေစဉ် အပေါ်ယံသို့ ဝေ့တက်လာသော ဆီနှင့် အမြှုပ်ညစ်များကို ဖယ်ရှားပစ်ပါ။ ခဏအကြာတွင် ကြက်ဟင်းခါးသီးနှင့် ငါးငံပြာရည်ထည့်ပြီး အိုးကို အဖုံးဖုံးထားလို်က်ပါ။ မမွှေပါနှင့်။"",
                            ""နံနံပင်ဖြူး၍ ပူပူတည်ခင်းပါ။""
                        ],
                        ""ImageURL"": ""/img/10.jpg""
                    },
                    {
                        ""Title"": ""ချဥ်စပ်ထမင်းကြော်"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""ထမင်း"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး ၂ ခွက်""
                            },
                            {
                                ""Name"": ""ပုစွန်တုပ်ဖြူ (သို့) ကျားပုစွန်တုပ်"",
                                ""Amount"": ""၁၀ ကျပ်သား""
                            },
                            {
                                ""Name"": ""ဓားပြားရိုက်ထားသော ငရုတ်စပ်အစိမ်းနှင့် အနီ"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၂ ဇွန်း""
                            },
                            {
                                ""Name"": ""အလျားလိုက်လှီးထားသော ကြက်သွန်နီဥကြီး"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံးတစ်ဝက်""
                            },
                            {
                                ""Name"": ""စဉ်းထားသော ကြက်သွန်ဖြူ"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၁ ဇွန်း""
                            },
                            {
                                ""Name"": ""သကြား"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၁ ဇွန်း""
                            },
                            {
                                ""Name"": ""ငါးငံပြာရည်"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၂ ဇွန်း""
                            },
                            {
                                ""Name"": ""ဟင်းချက်ဆီ"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး လေးပုံတစ်ပုံ""
                            }
                        ],
                        ""Method"": [
                            ""ပုစွန်တုပ်များကို ရေဆေးပြီး ကိုင်ပါ။ ကျောမှ အကြောမျှင်မည်းကို ထုတ်ပစ်ပါ။ အမြီးများကို ချန်ထားပါ။"",
                            ""ဒယ်အိုးအတွင်း ဆီထည့်ပြီး မီးအနေတော်ဖြင့် တည်ပါ။ ဆီကျက်လျှင် ကြက်သွန်ဖြူထည့်ပြီး ရွှေရောင်ဝင်းလာသည်အထိ ကြော်ပါ။ထို့နောက် ပုစွန်တုပ်၊ ငရုတ်သီး၊ ကြက်သွန်နီများထည့်ပါ။"",
                            ""သကြားနှင့် ငါးငံပြာရည်ခတ်ကာ ပုစွန်တုပ်ကျက်ပြီး ရနံ့သင်းပျံ့လာသည်အထိ ဆက်၍မွှေကြော်ပါ။"",
                            ""ထို့နောက် ထမင်းထည့်ပြီး ပုစွန်တုပ်မျာနှင့် ရောမွှေကြော်ပါ။ သခွားသီး၊ ကြက်သွန်မြိတ်တို့နှင့် တွဲဖက်ပြီး ပူပူတည်ခင်းပါ။""
                        ],
                        ""ImageURL"": ""/img/6.jpg""
                    },
                    {
                        ""Title"": ""မြေအိုးထမင်း"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""ထမင်း"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး ၁ ခွက်""
                            },
                            {
                                ""Name"": ""၀က်သား(တစ်ကိုက်စာအတုံးလေးများ)"",
                                ""Amount"": ""၇ ကျပ်ခွဲသား""
                            },
                            {
                                ""Name"": ""ကောက်ရိုးမှို(ထက်ဝက်ခြမ်း)"",
                                ""Amount"": ""၅ ပွင့်""
                            },
                            {
                                ""Name"": ""ကြက်သွန်မြိတ်(တိုတိုလှီး)"",
                                ""Amount"": ""၁ ပင်""
                            },
                            {
                                ""Name"": ""ငရုတ်ရှည်အနီ(ထောင့်ဖြတ်လှီး)"",
                                ""Amount"": ""၁ တောင့်""
                            },
                            {
                                ""Name"": ""ချင်း(နုတ်နုတ်စဉ်း)"",
                                ""Amount"": ""၁ ဇွန်း(စားပွဲတင်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ပဲငံပြာရည်အကြည်"",
                                ""Amount"": ""၁ ဇွန်း(လက်ဖက်ရည်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ကမာဆော့စ်"",
                                ""Amount"": ""၁ ဇွန်း(စားပွဲတင်ဇွန်း)""
                            },
                            {
                                ""Name"": ""ဟင်းချက်ဆီ"",
                                ""Amount"": ""၁ ဇွန်းမှ ၂ ဇွန်း(စားပွဲတင်ဇွန်း)""
                            }
                        ],
                        ""Method"": [
                            ""ဒယ်အိုးအတွင်း ဆီထည့်ပြီး မီးအပူပေးပါ။ ဆီကျက်လျှင် ၀က်သားထည့်၍ ကြော်ပါ။ ထို့နောက် ချင်း၊ မှိုနှင့် ကြက်သွန်မြိတ်များထည့်ပါ။"",
                            ""ကမောဆော့စ်နှင့် ပဲငံပြာရည်ခတ်ပါ။ အားလုံး ကောင်းကောင်းကျက်လျှင် မီးပေါ်မှ ဖယ်ရှားပါ။"",
                            ""ထမင်းထည့်ပြီး အားလုံးနှင့် သမသွားအောင် ရောနယ်ပါ။ ထို့နောက် အဖုံးပါသော မြေအိုးအတွင်းထည့်ပါ။"",
                            ""ငရုတ်ကောင်းဖြူးပြီး မြေအိုးအဖုံးကို ပိတ်ပါ။ ဖိုထဲတွင် 375 ံF မီးရှိန်ဖြင့် ၅ မိနစ်မှ ၈ မိနစ်အထိ ဖုတ်ပါ။ ပူပူ တည်ခင်းပါ။""
                        ],
                        ""ImageURL"": ""/img/7.jpg""
                    },
                    {
                        ""Title"": ""မှိုမြေအိုးထမင်း"",
                        ""Ingredients"": [
                            {
                                ""Name"": ""ထမင်း"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး ၂ ခွက်""
                            },
                            {
                                ""Name"": ""ထက်ခြမ်းလှီးထားသော ကောက်ရိုးမှို"",
                                ""Amount"": ""၁၀ ကျပ်သား""
                            },
                            {
                                ""Name"": ""ရေစိမ်ပြီး အစိတ်စိတ်လှီးထားသော ရှီအီတာကီမှို"",
                                ""Amount"": ""၂ ပွင့်""
                            },
                            {
                                ""Name"": ""အကြောမျှင်များဖယ်ပြီး ၁ စင်တီမီတာ အရှည်ဖြတ်ထားသော ဗိုလ်စားပဲ"",
                                ""Amount"": ""၅ တောင့်""
                            },
                            {
                                ""Name"": ""အတုံးလေးများလှီးထားသော နာနတ်သီး"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး လေးပုံတစ်ပုံ""
                            },
                            {
                                ""Name"": ""ပြောင်းဖူးစေ့"",
                                ""Amount"": ""လက်ဖက်ရည်ပန်းကန်လုံး လေးပုံတစ်ပုံ""
                            },
                            {
                                ""Name"": ""ငရုတ်ကောင်းမှုန့် "",
                                ""Amount"": ""လက်ဖက်ရည်ဇွန်း လေးပုံတစ်ပုံ""
                            },
                            {
                                ""Name"": ""သကြား"",
                                ""Amount"": ""လက်ဖက်ရည် ၁ ဇွန်း""
                            },
                            {
                                ""Name"": ""ပဲငံပြာရည်အကြည်"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၂ ဇွန်း""
                            },
                            {
                                ""Name"": ""ဟင်းသီးဟင်းရွက်ဆီ"",
                                ""Amount"": ""စားပွဲတင်ဇွန်း ၂ ဇွန်း""
                            }
                        ],
                        ""Method"": [
                            ""ဒယ်အိုးအတွင်းဆီထည့်ပြီး မီးပြင်းပြင်းဖြင့် အပူပေးပါ။ ဆီကျက်လျှင် မှိုနှစ်မျိုး ဗိုလ်စားပဲ၊ နာနတ်သီး၊ ခရမ်းချဉ်းသီးနှင့် ပြောင်းဖူးစေ့များ ထည့်ကြော်ပါ။"",
                            ""ပဲငံပြာရည်နှင့် သကြားခတ်ပါ။ အားလုံးအနေတော်ဖြစ်လျှင် မီးပေါ်မှဖယ်ရှားပေးပါ။"",
                            ""ထမင်းထည့်ပြီး သမအောင်ရောမွှေပါ။ ထို့နောက်မြေအိုးအတွင်း ခပ်ထည့်ပြီး ငရုတ်ကောင်းဖြူးပါ။ ဖိုအတွင်း 375 ံF နှင့် ၁၀ မိနစ်ခန့် ဖုတ်ပါ။"",
                            ""ငရုတ်ကောင်းဖြူးပြီး မြေအိုးအဖုံးကို ပိတ်ပါ။ ဖိုထဲတွင် 375 ံF မီးရှိန်ဖြင့် ၅ မိနစ်မှ ၈ မိနစ်အထိ ဖုတ်ပါ။ ပူပူ တည်ခင်းပါ။""
                        ],
                        ""ImageURL"": ""/img/8.jpg""
                    }
                ]
                ";

            Recipes = JsonConvert.DeserializeObject<List<Recipe>>(jsondata);
        }
    }
}
